Selenium_CS/Orasi/API/Apps/Predic8/Services/ArticleService/Operations/RequestXmlWarehouse/Create.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://predic8.com/wsdl/material/ArticleService/1/">
  <soapenv:Header/>
  <soapenv:Body>
    <ns:create>
      <article>
        <name>?</name>
        <description>?</description>
        <price>
          <amount>?</amount>
          <currency>?</currency>
        </price>
        <id>?</id>
      </article>
    </ns:create>
  </soapenv:Body>
</soapenv:Envelope>